using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Study_2.Composite
{
    internal class Composite
    {
        // КОМПОНОВЩИК (COMPOSITE) - Паттерн, позволяющий нам соединить группу объектов в древовидную структуру, а впоследствии работать с ними как с единичным объектом.

        // Применение:
        // Тогда, когда объекты должны быть реализованы в виде иерархической древовидной структуры.
        // Когда клиентский код должен одинаково управлять как целыми объектами, так и их составными частями,
        // то есть и целый объект, и его структурные части должны реализовывать один и тот же интерфейс.


    }
}
